---
kind: method
id: M:Autodesk.Revit.DB.FabricationItemFolder.GetSubFolders
source: html/997c0284-416a-68ca-4ff0-cc1afebf05f7.htm
---
# Autodesk.Revit.DB.FabricationItemFolder.GetSubFolders Method

Gets the item folder's sub folders.

## Syntax (C#)
```csharp
public IList<FabricationItemFolder> GetSubFolders()
```